/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_putstrc.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: wballaba <wballaba@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2018/12/10 21:10:47 by wballaba          #+#    #+#             */
/*   Updated: 2019/02/04 20:35:24 by wballaba         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

/*
** Печатает строку до символа с или до конца строки если символ не встретится
*/

void	ft_putstrc(char const *s, unsigned int c)
{
	int i;

	i = 0;
	if (s != NULL)
	{
		while (s[i] != '\0' && s[i] != (unsigned char)c)
		{
			write(1, &s[i], 1);
			i++;
		}
	}
}
