/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_strdup.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: wballaba <wballaba@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2019/02/04 20:31:42 by wballaba          #+#    #+#             */
/*   Updated: 2019/02/04 20:49:07 by wballaba         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

/*
** Функция выделяет память, достаточную для хранения дубликата строки,
** на которую указывает str, а затем производит копирование этой строки
** в выделенную область и возвращает указатель на нее.
*/

char	*ft_strdup(const char *s1)
{
	char	*dest;
	int		i;

	i = 0;
	if (s1 == NULL)
		return (NULL);
	if (!(dest = (char *)malloc(sizeof(char) * (ft_strlen(s1) + 1))))
		return (0);
	while (s1[i])
	{
		dest[i] = s1[i];
		i++;
	}
	dest[i] = '\0';
	return (dest);
}
