/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_strrchr.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: wballaba <wballaba@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2018/11/26 18:02:49 by wballaba          #+#    #+#             */
/*   Updated: 2019/02/04 21:26:04 by wballaba         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

/*
**  Функция strrchr находит последнее вхождение символа c в строке string.
**  Нулевой символ окончания ('\0') строки string включается в поиск.
*/

char	*ft_strrchr(const char *str, int c)
{
	int len;

	len = 0;
	while (str[len] != '\0')
	{
		len++;
	}
	while (len >= 0)
	{
		if (str[len] == c)
		{
			return ((char *)&str[len]);
		}
		len--;
	}
	return (NULL);
}
