/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_strncat.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: wballaba <wballaba@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2018/11/27 03:44:35 by jwillem-          #+#    #+#             */
/*   Updated: 2019/02/04 21:12:57 by wballaba         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

/*
** Функция strncat() добавляет к строке, на которую указывает str1, не более
** count символов из строки, на которую указывает str2. В конце модифицированной
** строки str1 функция ставит нуле­вой символ. Нулевой символ, первоначально
** завершавший строку str1, замещается первым симво­лом строки str2. Строка str2
** остается в первоначальном виде.Функция strncat() возвращает указатель str1.
*/

char	*ft_strncat(char *s1, const char *s2, size_t n)
{
	size_t	i;
	size_t	j;

	i = ft_strlen(s1);
	j = 0;
	while (s2[j] && j < n)
	{
		s1[i] = s2[j];
		i++;
		j++;
	}
	s1[i] = '\0';
	return (s1);
}
