/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_strchr.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: wballaba <wballaba@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2018/11/26 17:25:41 by wballaba          #+#    #+#             */
/*   Updated: 2019/02/04 20:39:25 by wballaba         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

/*
** Функция strchr выполняет поиск первого вхождения символа symbol в строку
** string. Возвращает указатель на первое вхождение символа в строке.
** Завершающий нулевой символ считается частью Си-строки. Таким образом, он
** также может быть найден для получения указателя на конец строки.
*/

char	*ft_strchr(const char *str, int c)
{
	while (*str)
	{
		if (*str == c)
		{
			return ((char *)str);
		}
		str++;
	}
	if (c == '\0')
		return ((char *)str);
	return (NULL);
}
