/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_strpbrk.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: wballaba <wballaba@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2018/12/08 15:40:53 by wballaba          #+#    #+#             */
/*   Updated: 2019/02/04 21:52:09 by wballaba         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

/*
** Функция strpbrk() возвращает указатель на первый символ в строке, на которую
** указывает str1, совпадающий с каким-нибудь из символов строки, на которую
** указывает str2. Нулевые символы в конце строк в рассмотрение не включаются.
** Если совпадений нет, возвращается NULL.
*/

char	*ft_strpbrk(const char *s, const char *accept)
{
	if (s == NULL || accept == NULL)
		return (NULL);
	while (*s != '\0')
	{
		if (ft_strchr(accept, *s) != NULL)
			return ((char*)s);
		s++;
	}
	return (NULL);
}
