/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_strcount.c                                      :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: wballaba <wballaba@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2019/02/14 18:12:32 by wballaba          #+#    #+#             */
/*   Updated: 2019/02/14 18:15:00 by wballaba         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

/*
** Эта функция считает кол-во строк в двумерном массиве
*/

size_t	ft_strcount(const char **s)
{
	size_t i;

	i = 0;
	if (!s)
		return (0);
	while (s[i] != NULL)
	{
		i++;
	}
	return (i);
}
