/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_strncpy.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: wballaba <wballaba@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2018/11/23 19:31:53 by wballaba          #+#    #+#             */
/*   Updated: 2019/02/04 21:16:13 by wballaba         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

/*
** Функция strcpy() используется для копирования содержимого str2 в str1,
** не более чем n символов из двух строк.
** Аргумент str2 должен быть указателем на строку, оканчивающуюся нулем.
** Функция strcpy() возвращает указатель на str1. Если строки str1 и str2
** перекрываются, то поведение функции strcpy() не определено.
*/

char	*ft_strncpy(char *dst, const char *src, size_t n)
{
	size_t	i;
	int		endline;

	i = 0;
	endline = 0;
	while (i < n)
	{
		if (src[i] != '\0' && endline == 0)
			dst[i] = src[i];
		else
		{
			dst[i] = '\0';
			endline = 1;
		}
		i++;
	}
	return (dst);
}
