/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_strcpy.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: wballaba <wballaba@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2018/11/23 19:10:49 by wballaba          #+#    #+#             */
/*   Updated: 2019/02/04 20:46:50 by wballaba         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

/*
** Функция strcpy() используется для копирования содержимого str2 в str1.
** Аргумент str2 должен быть указателем на строку, оканчивающуюся нулем.
** Функция strcpy() возвращает указатель на str1. Если строки str1 и str2
** перекрываются, то поведение функции strcpy() не определено.
*/

char	*ft_strcpy(char *destination, const char *source)
{
	int i;

	i = 0;
	while (source[i] != '\0')
	{
		destination[i] = source[i];
		i++;
	}
	destination[i] = '\0';
	return (destination);
}
