/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_intlen.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: wballaba <wballaba@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2018/12/08 16:06:51 by wballaba          #+#    #+#             */
/*   Updated: 2019/02/04 20:15:34 by wballaba         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

/*
** Функция cчитает кол-во символов в int
*/

int	ft_intlen(long n)
{
	int len;

	len = 0;
	if (n < 0)
		n *= -1;
	while (n >= 10)
	{
		len++;
		n = n / 10;
	}
	len++;
	return (len);
}
