/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_lstlen.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: wballaba <wballaba@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2018/12/08 17:12:31 by wballaba          #+#    #+#             */
/*   Updated: 2019/02/04 19:57:01 by wballaba         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

/*
** Считает кол-во элементов в списке
*/

size_t	ft_lstlen(t_list *alst)
{
	size_t i;

	i = 0;
	while (alst)
	{
		alst = alst->next;
		i++;
	}
	return (i);
}
