/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_close_file.c                                    :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: wballaba <wballaba@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2018/12/15 17:06:58 by wballaba          #+#    #+#             */
/*   Updated: 2019/02/04 19:42:02 by wballaba         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

/*
** закрытие файла
*/

void	ft_close_file(int fd)
{
	if (close(fd) == -1 && fd == 3)
		ft_putstr("Failed closing");
}
